reuters/templates/validate_token.xml

<?xml version="1.0"?>
<Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header>
        <To xmlns="http://www.w3.org/2005/08/addressing">https://api.rkd.reuters.com/api/TokenManagement/TokenManagement.svc</To>
        <MessageID xmlns="http://www.w3.org/2005/08/addressing">b84399bc73214a45b006a3925ea3e4f5</MessageID>
        <Action xmlns="http://www.w3.org/2005/08/addressing">http://www.reuters.com/ns/2006/05/01/webservices/rkd/TokenManagement_1/ValidateToken_1</Action>
        <Authorization xmlns="http://www.reuters.com/ns/2006/05/01/webservices/rkd/Common_1">
            <ApplicationID>{{ application_id }}</ApplicationID>
            <Token>{{ token }}</Token>
        </Authorization>
    </Header>
    <Body>
        <ValidateToken_Request_1 xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.reuters.com/ns/2006/05/01/webservices/rkd/TokenManagement_1">
            <ApplicationID xmlns="http://www.reuters.com/ns/2006/05/01/webservices/rkd/Common_1">{{ application_id }}</ApplicationID>
            <Token xmlns="http://www.reuters.com/ns/2006/05/01/webservices/rkd/Common_1">{{ token }}</Token>
        </ValidateToken_Request_1>
    </Body>
</Envelope>

